
{
  "title":         "Seven Basketball Tips For Young Players",
  "category":      "Athletics",
  "author":        "Sidney Goldstein",
  "authorUrl":     "http://www.mrbasketball.net/instuff/30tips/e1tipsYoungPlayers.html",
  "publishedOn":   "01-08-01",
  "body":          "<strong> Seven Basketball Tips For Young Players </strong> <br> </br>
  1. All Great Players Are Great Athletes <br>
  The most important thing you can do to improve your game is to become a good athlete. The stronger and faster you are, the better you will play. Achieve this goal through conditioning and weight training. Have a physical check-up by your doctor before you start training .Conditioning is easy. Start with 15 minutes of continuous motion, either jogging or, even better, running full court with the ball. Dribble, shoot, and rebound as usual; don't stop moving for the time allotted. You do not need to move quickly. After a week or two of conditioning you will find a comfortable pace. Then, increase the time you spend in the activity according to your performance. Do this every day. Increase moving time about five minutes a week after the first two-four weeks.
  Weight training is very helpful. However, there is some disagreement on what age a child can start. One theory says that a build up of muscle mass while bones are growing can limit growth. Some tall body builders disagree, and use themselves as an example to the contrary. Make sure you are well supervised and get advice if you weight train.Any physical education teacher and most coaches can show you how to do push ups, sit-ups, and other various strengthening exercises. Twenty minutes of instruction will reap great rewards. Remember that you always must underdo these exercises at first so that you can find your level. Underdoing means that you put out a minimum of effort. Do as few as possible, rather than exercise to exhaustion. (The no pain, no gain philosophy definitely doesn't work for beginners. I question whether or not this approach works for athletes in good shape.) This approach prevents injury.
  Don't forget stretching. Stretching permits you to have a more full range of motion allowing you to twist and turn more readily. You will even run faster. Any physical education teacher or coach can give you tons of stretching exercises. Make sure to warm-up before stretching and always hold the position, never move back and forth.

  <br> 2. You Can't Shoot Properly Unless You Hold The Ball Correctly </br>
  The most difficult skills, including shooting, passing, catching, dribbling, and rebounding, involve holding the ball. There are many signs of faulty ball handling: dropping passes; spraining and jamming fingers; palming the ball; rebounding poorly, shooting poorly. I can't overemphasize the importance of working on this skill daily.Here is how to practice holding the ball:
  1. Make both hands into claws. Growl like a lion and move the claws forward like you are going to rip something apart.
  2. Make sure your fingers are far apart.
  3. Put the ball between the claws and hold the ball securely. Your only contact with the ball should be your finger ends, not the pads. The palm and other parts of the hand do not touch the ball. Overdoing the hold this way is most beneficial.
  4. Hold the ball as long as possible at home while watching TV or listening to the radio. Before practice, hold the ball for a minute or two and at every other opportunity.

  <br> 3. Use Your Wrists In Shooting, Passing, and Dribbling <br>
  The wrist skills, which include shooting, passing, and dribbling, involve the motion of the hand and wrist. Waving good-bye is an example of wrist motion that needs to be practiced. This rarely practiced motion reaps incredible benefits. Not only will you improve, but you will permanently improve.Here is how to practice:
  1. While standing, put your arms straight up overhead, palms facing forward. Keep your elbows straight and do not move your arms throughout the exercise.
  2. With your hands slightly clawed, flick your wrist backward and let it come forward without additional effort. Continue to flick your wrists backward. You are doing this correctly if your hand and wrist go back and forth like a wet noodle. Make sure to keep your hands in a slightly clawed position.
  3. Continue doing this for one to two minutes. Initially this motion will be very difficult.
  4. This first part of the exercise helps with shooting and passing. For help with dribbling, lower the arms to the side with the palms facing backward.
  5. With elbows straight and arms stationary, flick the wrist forward and let it come back without effort. Continue doing this for one-two minutes. Make sure the hand is slightly clawed.
  6. Do these exercises as often as possible. Make them part of your normal practice warm-up. The more difficult this exercise is to do, the more you need it. It may take one month or more to properly do these exercises.
  <br> 4. Pivoting Is A Key To Many Other Skills <br>
Many players and coaches underestimate the importance of pivoting. Every movement with the ball initially involves pivoting. Players routinely pivot to shoot or pass. What is not so obvious is that all moves, most fakes, and driving to the basket all depend on the ability to pivot. Poor pivoters do not have moves and cannot drive well to the basket.You must be able to pivot forward and backward using either foot. So each exercise must be repeated four times: left foot forward; left foot backward; right foot forward; right foot backward.The pivot foot is the foot that stays in place. Actually only one part of the foot, the ball of the foot, stays stationary. As you turn, the rest of the foot rotates about the ball of the foot. If you slide or change your pivot point after you have the ball, officials call a walking violation. Your team loses the ball.
Here is how to practice pivoting:
1. Start with the left foot as pivot foot. If you have a ball, hold it in the exaggerated claw position during this exercise.
2. Pivot forward 15 times like you are stomping on bugs as you go. As you find your balance, increase the rotation to a half turn.
3. Repeat rotating backward 15 times.
4. Switch pivot foot. Repeat forward 15 times.
5. Repeat backward 15 times. Have a bystander or friend watch for several things. You must keep your head up like you would in a game. Your pivot point must not change. Your pivot foot does not slide.

<br> 5. Defense Is Easy To Learn <br>
Your stance for defense and dribbling is very similar. In both positions you need to be ready to run full speed in any direction. Tap dancing on your toes while in position helps you to practice tap dancing.
How to get in position:
1. In a standing position, move your feet to slightly greater than shoulder width apart.
2. Bend your knees, keeping your back straight and vertical, not bent, till you are down as far as you can go. Then come halfway up.
3. Move the arms slightly outward from the shoulders and move the forearms parallel to the ground.
4. The hands should be slightly clawed in what I call the ready position.
What to do in position:
5. Tap dance by quickly bringing the knees slightly up (one-two inches) and down one at a time.
6. Count to 20, one tap at a time.
7. Then sprint four steps forward. Tap and count to 20 again.
8. Pivot around and sprint four steps backwards. Face the original direction, and tap and count to 20 again.
9. Continue for five minutes, moving back and forth and then left and right.

<br> 6. Practice shooting from one foot, rather than from greater distances. Unless you shoot with the proper technique, practicing from great distances distorts your shot. Improper practice makes your shot worse. So, practice from one foot while you develop your shot.
Here is how to practice:
Take 10 one foot shots from the right side of the basket, then 10 from the left, and then 10 from the center. Use the backboard from all three positions. You can repeat this many times.

<br> 7. Play full court rather than half court <br>
Half-court street basketball is very different from full court ball. Here are some problems associated with half court ball:
• Half court does not have a transition from one basket to the other. Starting a play half court and starting one full court is very different.
• In half court games you do not need to run full speed for great distances. In full court games, you must perform out of breathe after sprinting down court three or four times.
• Players congregate closer to the basket in half court than in full court, yielding more three second violations.
• In half court you are so close to the basket that players readily go one-on-one, rather than play team ball.
• In half court you have a greater chance for injury: since players must make many direction changes in a small crowded area."
},

{
  "title":           "5 Exercises to Improve Power - USA Basketball",
  "category":          "Athletics",
  "author":        "Mike Mahon",
  "authorUrl":      "http://www.usab.com/youth/news/2010/03/5exercises-to-improve-power.aspx",
  "publishedOn":        "2015-02-05",
  "body":        "<strong> 5 Exercises to Improve Power - USA Basketball </strong> <br>
  If I could show you five exercises that will noticeably improve your total body power and performance on the basketball court, these would be it. These exercises are great because they can be done on your own, are quick, effective and produce great results.
  Power is important on the court, so let’s make you a force to reckon with when the games start.
  <br> <strong> Basketball Plyo Push Ups </strong> <br>
  This exercise will help basketball players learn how to give and absorb force effectively and efficiently. Mastery of this exercise will translate into quicker, more explosive hands and a powerful upper body ready to dominate the hardwood.
  <br> How to Perform It: <br>
  Place yourself in a push-up position, straddling the basketball with both of your hands.
  Lower yourself down halfway to the ground.
  Violently explode off the floor and catch and stabilize yourself on your basketball and hold for a one count.
  Toss yourself off and land softly on the floor.
  Repeat for desired repetitions.
  <br> <strong> Medicine Ball Wall Throws </strong> <br>
  This drill is great for hand-eye coordination, and the nature of the motions will dramatically improve your ability to pass, catch and control the basketball. That will drastically transfer to more precise passing and catching abilities on the court along with your new greater sense of power.
  <br> How to Perform It: <br>
  Face a wall with a medicine ball in your hands around chest height.
  Violently fire the medicine ball at a predetermined target at the wall.
  Have your hands out in front of you ready to absorb the rebound of the ball off the wall.
  Catch the ball.
  Fire it back at the wall for desired repetitions or time.
  <br> <strong> Medicine Ball Rotational Side Wall Throws </strong> <br>
  This drill is another great power exercise that every basketball player should learn to perform. I love it because just like all the previous exercises, it improves your hand-eye coordination, which is vital to becoming a successful basketball player. It also dramatically improves your body core strength, and ability to explosively change direction. Talk about a bang-for-your-buck exercise.
  <br> How to Perform It: <br>
  Stand in an athletic stance with your feet shoulder-width apart facing the wall sideways.
  Hold the medicine ball with both hands and arms only slightly bent on the side of your hip farthest away from the wall.
  Swing ball over to your hip and violently toss the ball underhand and forward against the wall.
  Have your hands up and ready to receive the rebound of the ball back to you.
  Catch ball on the bounce from your wall and make sure that you repeat it again and again.
  Make sure you work on the drills with both sides of your body.

  <br> <strong> Medicine Ball Slams </strong> <br>
  Medicine ball slams are a tremendous upper-body strength and power builder for basketball player. This exercise is great because it can be done in a relative small area of space, it improves your sports performance, and players really enjoy doing it.
  <br> How to Perform It: <br>
  Stand in an athletic stance with your feet shoulder-width apart and the medicine ball tucked behind your head.
  Explosively and forcefully slam the medicine ball into the ground as hard as you can.
  Squat down and pick up the medicine ball and repeat for desired repetitions.

  <br> <strong> Medicine Ball Squat Throws <br> <strong>
  Of all the great basketball explosion exercises, squat throws is by far my favorite exercise. I like this exercise because it teaches you how to transfer the energy from the ground and explosively release it through your hands. Many players have trouble mastering this concept, but after regularly performing this exercise, they become much more explosive from head to toe.
  <br> How to Perform It: <br>
  Stand in an athletic stance with your feet shoulder-width apart while you are holding a medicine ball and chest level.
  Quickly squat down to parallel
  Explosively jump straight up and explode the medicine ball above your head as high as you can.
  Let the medicine ball drop to the ground, pick it up and repeat steps 1-3 for desired reps."
},

{
  "title":           "Basketball Skills – 7 Ways To Improve Yours",
  "category":        "Athletics",
  "author":        "Triple Threat Academy",
  "authorUrl":     "http://www.triplethreatonline.com/articles/basketball-skills-7-ways-improve/",
  "publishedOn":    "2014-05-15",
  "body":           "<strong> Basketball Skills – 7 Ways To Improve Yours </strong> <br>
  It’s important for a young basketball player to spend timebasketball skills practice improving his or her basketball skills. To many players there is nothing more exciting than finding new ways to improve their game. In addition to Triple Threat Academy’s camps and trainings it’s always fun and exciting for players to find other ways to improve their game. They know that it can give them an edge on their competitors and could be exactly what they need to start the next season off right.
  With some hard work on improving their basketball skills in the off season, they may get more time on the court, better numbers in the stat sheet, and more accolades at season’s end. Here are seven of the best ways to build on what you learn at Triple Threat Academy camps and improve your game.
  <br> Play Games Out of Season <br>
  There are a lot of opportunities for youngsters to play in games before the season ends. Teenagers can look for AAU leagues to join, and for those who want a less serious commitment, there are summer leagues in most major US cities.
  In addition to AAU and summer leagues, most schools have open gyms where you can get some extra time on the court not just out of season, but in-season as well. As important as it is to work on detailed skills in the offseason, it’s also important to incorporate those skills at game speed, so staying sharp with off-season games is a great way to keep your skills sharp.
  <br> Practice Chair Drills <br>
  Lots of kids who are dedicated to playing basketball find that it’s hard to find other kids who will keep up with their passion. In the summer, or after practice, most kids want to go to the mall, play video games, or just hang out. For the kid that wants to keep playing basketball, chair drills can be extremely handy as a substitute for another player.
  Set up stacks of chairs on a court, and use them to practice dribbling and shooting drills. The chairs can simulate the size of a player, and force you to keep your head up and navigate around them while maintaining speed and focus.
  <br> Focus on Strength and Conditioning <br>
  Most players start the season a little bit out of shape and out of practice. A kid who spends the summer and fall conditioning will be leaps ahead of his or her teammates when the season starts. Strength workouts are key for keeping fighting fit in the off season, as they can help players build muscles that are greatly helpful for basketball skills.
  <br> Eat Right <br>
  While just about everyone loves to chow down on junk food, those looking to improve their basketball skills would do better to stick to healthy snacks to give their game an edge. Kids, parents and coaches alike can read a book or two about nutrition, and incorporate what they learn into their training. A proper diet gives a young player superior energy and strength, which will show on the court.
  <br> Get Plenty of Sleep <br>
  Most kids don’t want to hear this, but getting enough sleep can be the difference between being sluggish on the court and running laps around the competition. Kids who get at least eight hours of sleep a night have far more energy when they lace up their shoes and hit the court.
  <br> Set Shooting Goals <br>
  The best way to improve your jump shot is through repetition; as with so many things, practice makes perfect. However, repetition can get a little flat and boring without setting some goals. Set a goal for every day: something such as 150 jumpers from three different spots, or 200 made free throws. Then try to hit that goal every day – that will keep players hot out of season, and give them a huge edge when practice starts up again.
  <br> Try Multiple Ball and Tennis Ball Drills <br>
  The best way to improve basketball-related hand-eye coordination is running these two drills: practice dribbling two basketballs at once, and then practice dribbling one basketball with one hand, while catching tennis balls from a friend or parent with the other hand. Your ball skills will improve dramatically as you are forced to multitask and your hand-eye coordination improves.
  With these methods, any young player can experience a dramatic improvement in his or her basketball skills and what they bring to the game."
},

{
  "title":           "25 Ways To Improve Your Baseball Game",
  "category":        "Athletics",
  "author":        "Vincent Matarrese",
  "authorUrl":     "http://www.upgradedslugger.com/blog/25-ways-to-improve-your-baseball-game",
  "publishedOn":        "2015-04-17",
  "body":           "<strong> 25 Ways To Improve Your Baseball Game </strong> <br> </br>
  <br> 1 - START A BASEBALL JOURNAL <br>
  With today's technology many professional baseball players keep an electronic journal of their at-bats with notes for each pitcher. For you this may no be an option so I suggest keeping a physical or electronic journal of mechanical fixes your working on, mindset tendencies and to review your at-bats. The purpose is to think and breakdown your performance outside of the game or practice then record so you can build on past ideas or reference experiences.
  <br> 2 - COMPLETE A DAILY MOBILITY ROUTINE <br>
  First, mobility and flexibility are two different things. What mobility work focuses on is ensuring that muscle, fascia and other tissue is free of knots and tight spots that will restrict movement. The most popular mobility method uses self-massage with foam roller, lacrosse ball (baseball and softballs will work) and band assistance. For more information I recommend checking out Dr. Kelly Starrett and his mobilitywod project on Youtube or on mobilitywod.com. Also, read his book Becoming a Supple Leopard
  <br> 3 - IMPLEMENT A POST PRACTICE AND GAME COOL DOWN <br>
  This might be the most overlooked part of your training and performance regiment. After practice and games you MUST cool down to prevent injury and increase your bodies ability to recover. (Don't believe me check out the Guide to Sports Medicine) Finishing a practice or training session then going home is like going 70 on the freeway then turning your engine off! What to do? It's quick and easy, complete (3) rounds of an easy jog for 2 minutes, then 10 squats and 10 push ups followed by a few simple stretches.
  <br> 4 - DEVELOP AND RECORD PITCH COUNT MINDSETS <br>
  Many times players will have inconsistent pitch count mindsets which leave them thinking and questioning themselves during at-bats. Determine your mindset before the game starts so that during the game you can avoid any doubts. To do this know what your strengths and weaknesses are such as if you perform better when guessing pitches or when you are simply seeing the ball. If you perform better when thoughtless then keep it simple, even or ahead in the count focus on attacking while behind in the count focus on relaxing and surviving to see another pitch. Whatever you do, have a plan set so you do not question yourself during competition. I know that strategies change based on the pitcher's game but your mindset should be set.
  <br> 5 - IDENTIFY YOUR GOAT AND WORK IT EVERYDAY <br>
  To begin, your GOAT is the biggest weakness or deficiency in your game. It could be breaking balls, panicking with two strikes, inside fastballs, etc. Once you have identified this limiting factor, spend 10-15 minutes everyday working on improving it. After a few weeks you will notice a huge difference IF you are practicing effectively.
  <br> 6 - STEP UP YOUR MENTAL TOUGHNESS <br>
  It is no coincidence that top performers from every field, not just sports, are mentally tough and gritty. To play at the next level you will have to develop a higher level of toughness or you will crumble under the pressures of competition. The best way to improve your mental toughness is by completing challenges. For details check out this post on getting tougher.
  <br> 7 - BE THE LEADER EVERY TEAM NEEDS <br>
  Leadership in sports and the work place is a crucial trait to have. In baseball I view leadership skills as a multiplier to your physical skills. The best part about being a leader is that there are many ways to express leadership skills and it only takes a little work to get start. For details check out this post on becoming your own leader.
  <br> 8 - GET YOUR NUTRITION IN ORDER <br>
  If you are an athlete it's time to start treating food as fuel instead of purely pleasure. The obvious reason is to improve body composition for athletic performance. If you are looking to drop some fat weight then start with a food log and change your regularly consumed foods. Here is a good start (Click Here). Another reason to cut out the junk food (stop BS'ing yourself, you know what junk food is) is that excessive sugar consumption is linked to weaker cognitive function, processing speed and short term memory recollection (see Diet and Exercise in Cognitive Function and Neurological Diseases By Akhlaq A. Farooqui, Tahira Farooqu.). Cognitive function is linked to feeling in the zone so eat what will maximize your brain function. During athletic events, cognitive performance is VERY IMPORTANT!
  <br> 9 - VIDEO RECORD AND STUDY YOUR SWING <br>
  There is no excuse for not consistently video recording your swing and reviewing with a trusted coach or comparing with a major leaguerer. If you don't know what to look for check out these articles that detail mechanical positions
  <br> 10 - OBSESSIVELY WATCH VIDEO OF YOUR FAVORITE PLAYER <br>
  Growing up my parents didn't have cable so there was never any baseball for me to watch. Luckily, my grandparents would VHS record New York Mets games and mail the tape to me if Mike Piazza had a good game. I would watch his home run swings dozens of times then go outside and try to replicate what I saw. I can still picture his swing perfectly. Research shows that we can learn skills from watching something repetitively, so go find video of your favorite player and watch it everyday. Pay attention to joint angles, timing and rhyme. Check out The Talent Code by Daniel Coyle for more info into learning by visual aids.
  <br> 11 - PRACTICE SHORT TERM MEMORY LOSS <br>
  There is a great quote that I first heard from Vinny Rottino (profile), In baseball you must keep your highs low, and lows high. I don't know if he made that up himself but it is something I remind myself of all the time. In baseball huge performances bring the risk of over inflating your confidence and ego, while terrible games can lead to a prolonged hitting drought (I don't say the 's' word). To practice short term memory loss just sit alone and listen to a relaxing song. While that song plays recall what happened during your previous game, accept the outcomes and then discard it from your memory. When the song ends so does your recollection of the game.
  <br> 12 - SPEND TIME WITH THE RIGHT PEOPLE <br>
  You are the average of the FIVE people you spend the most time with. I don't know where this statement comes from but I know it is absolutely true. Change who you are spending time with, seek out players who work harder than you or anyone who is focused on greatness. Most importantly cut the out the losers! It may be hard to understand if you are in high school but you must get rid of the losers who have no focus. What's more important, realizing your dreams or hurting someone's feelings? I know that sounds like an A-hole statement but realizing goals is not always a nice.
  <br> 13 - SLEEP FOR PERFORMANCE <br>
  Have the discipline to go to bed early and wake up early. Nothing happens late at night that will help your performance the next day. Sure you may have fun with your friends or meet some girls but are these things more important than resting to reach your baseball dreams? Maybe they are more important, in that case your dreams will most likely not become reality.
  <br> 14 - HAVE GRATITUDE AND APPRECIATION <br>
  Why is practicing gratitude and appreciation important? Ask any of your baseball coaches who don't play anymore, or ask some parents, almost all of them will tell you their baseball careers went by incredibly fast and they would do anything to play again. Being grateful for your health, opportunities and situation is the BEST way to stay relaxed, forget bad performances and clear your mind. It just so happens that these things will also help you perform better. Practice this will driving to the diamond or when stretching.
  <br> 15 - ASK FOR HELP <br>
  It always amazes me how few players will actually ask a coach for some one-on-one help. During the baseball season there is little time for coaches to work individually when the entire team is present. Ask to work before or after with a trusted coach, which leads to the next tip...
  <br> 16 - BE THE FIRST PERSON TO THE DIAMOND <br>
  There are three main reasons why I feel being first to the diamond is important. First, getting to the diamond early for game day gives you ample time to forget all the other stuff that is going on in your life and relax. Second, lend a hand to whoever prepares the diamond for the game. Cutting the grass, striping the lines or fixing the batter's box will bring you a better appreciation for the game. Third, before teammates arrive you will have time to work on your weaknesses and seek one-on-one help from a coach.
  <br> 17 - PRACTICE DEEP BREATHING <br>
  <br> Deep diaphragm breathing is the best way to reduce your heart rate, relax and focus. Pay attention to the next MLB game you watch and you'll see all the deep breaths that players take between pitches. Use deep breathing to slow down heart rate in pressure game situations.
  <br> 18 - STOP USING THE 'S' WORD <br>
  I absolutely despise the word that rhymes with clump which is also freely thrown around by players of all ages and levels. The reason why I never use it or even say it is because once you define your current performance state with that word, you have an excuse for further bad performance. If you strikeout or line out, Oh well I'm in a S****. Not only do you see everything through the lens of the 's' word but you also make it incredibly difficult to forget past performances once you define yourself this way. So join me in forgetting about that word entirely.
  <br> 19 - IN-SEASON STRENGTH TRAINING IS A MUST <br>
  Strength training in-season is a must that every athlete should be doing to MAINTAIN strength throughout the season. What should you be doing? Keep it simple by completing simple lifts and movements at 65%-75% of your max. A good program is five sets of five with 65% of max. Get into the weight room a few times a week or simple knock out push ups, pull ups, lunges and squats at home. You will lose a lot of strength if you go 4-5 months without training.
  <br> 20 - ADDITION BY SUBTRACTION <br>
  In-season or out of season, it is important to be at your physical best especially with so many show cases available 12 months a year. For those that are strength and endurance training, you may gain the most by avoiding a few errors. What you want to avoid is anything that is leaving you weak (slow endurance training), stiff and immobile (body building) or just plain training something that doesn't apply to baseball movements.
  <br> 21- MOTIVATE YOURSELF FOR 30 MINUTES EACH DAY <br>
  This may be the easiest tip to implement. Every morning when you wake up read or watch motivational material. Here are some of my favorites: Tony Robbins, Eric Thomas, Arnold Schwarzenegger, Elliott Hulse, Les Brown, Joe Rogan, Nick Vujicic and don't forget clips from Rocky!
  <br> 22 - PRACTICE YOUR TIMING <br>
  The greatest swing mechanics and mindset will bring you zero success without pitch timing. The best way to work on having good timing in the game is to mimic the cadence and rhythm of a game when you are hitting on a tee, doing front toss and finally BP. Specifically what you are practicing is the breathing, load, slight pause, swing and contact that is identical to a well hit ball from a pitcher. This may be confusing so think back to when you were hitting great and the baseball looked like a beach ball. Every time you felt this way hitting and then proceeded to barrel the ball, you were experiencing GOOD timing. Now, think about when you are hitting poorly and the ball feels like an aspirin. This is bad timing. Practicing good timing is first visualizing it then following that rhythm whenever hitting. Stop rushing your tee and bp swings!
  <br> 23 - RECITE YOUR GOALS (YOU BETTER HAVE THEM WRITTEN DOWN ALREADY!) <br>
  One of my all time favorite books is Think Big and Grow Rich by Napoleon Hill. I've mentioned this book many times before but basically what he instructs is to write down your goals and read it to yourself with emotion twice a day. First thing when you wake up read your goals, stretch and motivate yourself. Before bed read your goals and visualize success tomorrow.
  <br> 24 - DO YOURSELF A FAVOR AND FAIL <br>
  One experience that all successful people have had is failure. Failure is something to be grateful for because it gives you the most to learn from and grow (Click Here for more failure lessons). To improve your game seek out any baseball experience with players from a higher level. One thing that I am constantly trying to do with my young catchers is to have them catch a bullpen from a much older player. If a 13 year old catcher can get through the challenges of receiving a college pitcher then I know they will have sky high confidence and they will become even more hungry to improve. Find a practice, show case or camp to attend with players that are better then you. Failure will just open your eyes to deficiencies
  <br> 25 - FOCUS ON CONSISTENT 1% IMPROVEMENTS <br>
  Making gains in anything can be discouraging and frustrating. Often times you will find yourself over exaggerating what you can do in a day but under estimating what you can accomplish in a day. The best strategy to improve your game is to have a 1% mindset daily and set huge goals in the long term. The 1% focus only works if you are CONSISTENT, so even on off days or rest days there is no excuse for not watching video, visualizing success or reading an inspiring book."
},

{
  "title":           "3 Effective Ways to Improve Your Baseball Skills",
  "category":        "Athletics",
  "author":        "Fan Shot",
  "authorUrl":      "http://metsminors.net/3-effective-ways-to-improve-your-baseball-skills/",
  "publishedOn":        "2015-01-30",
  "body":           "<strong> 3 Effective Ways to Improve Your Baseball Skills </strong> <br> </br>
When preparing to get into shape for any sport, such as physical conditioning through drills, repeating the same actions over and over again can become pretty monotonous for any athlete. Baseball practices, for example, are typically jammed with drill after drill in order to improve the skills of the team’s players in various areas. But like all sports, baseball season can only last so long and players may eventually have more free time than usual to improve their skills. However, rather than continue to perform the same drills, consider the fact that there are many other games and sports that exist that you can apply your baseball skills to as well. Best of all, once it’s time to return to the field, you may even find yourself to be a better baseball player than before.
<br> Learn & Apply Physics to Improve Your Batting Average <br> Similar to the action of pulling a lever (in terms of an object rotating around a point or axis), when a player swings the bat, the goal is to maximize the force of contact between the bat and the ball by utilizing the power of their body in the most efficient way. While there are several variables that play into this specific motion to make it successful, the force of contact is roughly related to the torque created by swinging the arms and bat, as well as the force of the torso. By determining the distance between the contact point from the axis of rotation, you can then figure out how strong the force of the swing will be. In simpler terms, as a batter you want to get the biggest bang for your buck. You don’t necessarily need to know any special equations to improve your batting average, but knowing how the force of your swings connects with the force of the ball is certainly a must.
<br> Practice Yoga to Increase the Power of Your Throws <br>
At times, the languid pace of a baseball game can give the impression that its teams’ players are not necessarily fit; however, image can only tell us so much. The fact of the matter is that baseball players need everything from quick and responsive reflexes to exceptional hand-eye coordination.
Though likely one of the last activities one would think to complement baseball well, yoga can be very helpful in strengthening and stretching both the mind and body, as well as giving players the advantage of being more focused in their intention for movement.
Incorporating yoga into your conditioning routine can be very helpful in building your core strength, which is essential to increasing the power of your pitches and your batting potential. Regardless of whether you are an infielder or outfielder, the flexibility gained in yoga will also increase your stride and follow-through when throwing, which is crucial for pitchers.
<br> Play Online Poker to Boost Your Decision Making <br>
In addition to keeping your physical strength and abilities in tip-top condition, it’s crucial to keep your mental reflexes just as tough. Especially in a game like baseball, having the ability to make quick decisions is crucial. For example, having to make the decision whether to steal third base or to wait until the pitcher puts the ball in play, or determining where you should aim to hit the ball based on how loaded the bases are. Regardless of whether you’re playing in the outfield or are at bat, being a great baseball player requires that you always be prepared for any situation.
While certainly not as physically demanding as playing baseball, online poker is widely known to be one of the best activities to improve mental quickness, patience, observation, self-awareness, and emotional intelligence.
In poker, players naturally learn how to continue randomizing their actions when determining when the best time will be to bluff. Most importantly, those who play poker learn about strategic interactions, particularly mixed strategies. A mixed strategy, in game theory, occurs when a player does not make the same move each time. For example, a pitcher will not typically throw the same curveball or fastball each time in order to keep the batter on his toes.
Furthermore, playing poker can also increase your math skills, which in turn can improve the way you understand the physics of baseball.
<br> <strong> Play Ball! </strong> <br>
At first it may seem as like the above activities wouldn’t complement each other at all. And while they may not be necessarily closely connected with baseball, they still offer many benefits to baseball players."
},

{
  "title":         "10 Ways to become better football Player",
  "category":        "Athletics",
  "author":        "Travis Brody",
  "authorUrl":     "http://www.growthofagame.com/2014/11/10-ways-become-better-football-player/",
  "publishedOn":        "2015-09-20",
  "body":          "<strong> 10 Ways to become better football Player </strong> <br>
  <br> 1. Practice Makes Perfect <br>
  There are countless ways to improve the level of your game, but actually playing your sport is what makes the greatest impact. Malcolm Gladwell, author of the book “Outliers: The Story of Success” (Amazon: USA/UK/FR/ES/DE/IT/BR) spent years researching the common denominators among some of the world’s most successful people. According to Gladwell, the key to success in any field is a matter of practicing a specific task for a total of approximately 10,000 hours. The “10,000-Hour Rule”, as it has come to be known, can be applied directly to sports to make you a top-level athlete. With enough time spent on the football field, you can become a phenom in your league and respected by your peers for your skill and dedication to the game.
  First and foremost, never miss a team practice. Showing up early to team training to get in some extra work not only gives you an advantage over your teammates and competition, it shows the coaches that you’re committed to the team and to becoming the best player you can be. Outside of scheduled practice time, you can meet up with a fellow teammate to practice skills: catching, blocking, passing, covering, and form tackling are just some of the things you can do. If you can’t find a partner, find time to train on your own. There are elements of every position that you can practice by yourself. Quarterbacks can work on their footwork, drop, and scrambling. Receivers can work on their routes and their release off the line. Linemen can work on their first move, footwork, and hands. Defensive backs can work on their backpedaling and break to the ball…and there’s much more. The question is not what can be done, but rather how committed are you to getting better?
  <br> 2. Learn the Rules <br>
  It happens every time a field goal or punt is deflected. Some players simply don’t know what to do – do I pick the ball up and run with it? Do I let it go? What happens if the opposing team picks it up? Even many NFL players are unaware of some of the rules of the game, and it’s their profession. If you don’t believe it, check out Donovan McNabb’s infamous press conference after the Philadelphia Eagles’ 13-13 tie vs. the Cincinnati Bengals in 2008 where he admitted he did had no idea a game could end in a tie. Talk about embarrassing.
  Knowing the rules better than your opponent can be the difference between winning and losing. Make sure to brush up on the rules of the game so you can avoid the same thing happening to you. Most leagues in Europe play by NCAA rules, so check out the updated NCAA Rule Book to brush up on any gaps in knowledge. Remember, knowing the rules means knowing ALL the rules.
  <br> 3. Lift, Lift, Lift <br>
  We all know that putting time in at the gym will get you bigger and faster. Focus on strength and mass, and less about looks. I can’t tell you how many guys I’ve played with that really looked the part, but couldn’t lay a block or make a tackle to save their lives. You’re training for football, not a swimsuit competition.
  Tim Ferriss, author of “The 4-Hour Body” (Amazon: USA/UK/FR/ES/DE/IT/BR), recommends focusing on a concept called the “minimum effective dose”. Rather than putting in 4-6 sets of one exercise he suggests maxing out on one set of 8+ reps until you can’t move the weight anymore, which is the minimum you need to lift to see the results you want to achieve. This way you’re getting 80 percent of the value with only 20 percent of the time and effort.
  Make sure you establish a solid plan and record all the details of your workouts. This will enable you to follow your progress and feel a sense of accomplishment every time you reach a personal best. No goal can be reached without a solid and realistic plan to get you there.
  <br> 4. Diet <br>
  Many nutritionists have estimated that what you eat accounts for 80% of muscle growth, while training accounts for only 20%. If you don’t watch what you put into your body, you’re unlikely to get the results you want. Protein is vital to muscle growth, and chances are you’re not getting enough protein in your diet. Dr. James Meschino, a renowned expert on dietary health and muscle development, suggests a simple formula to calculate your ideal daily protein intake. Moderately active people that exercise 5-7 times per week, including weight training 3-4 times a week, should multiply their weight in pounds by 0.6 (for kilos, multiply by 1.3) to calculate the number of grams of protein they should eat per day. People who engage in advanced activity, which includes exercise 5-7 times per week and at least 1 hour of weight training 5+ times per week, should multiply their weight in pounds by 0.7 (for kilos, multiply by 1.5) to get their number. Lastly, elite-level athletes should multiply their weight in pounds by 0.8 (for kilos, multiply by 1.7) to maximize their muscle growth.
  Stay away from processed foods, caffeine, and sugars. Eating meat is fine, but be aware that not all meat provides the same amount of protein per calorie. Lean meats such as chicken and turkey provide more protein with less calorie intake, while fatty meats such as beef and pork have a much higher calorie content. Skill positions such as receivers, defensive backs, running backs, and quarterbacks should focus on building lean mass (high protein/low calorie) while linemen and linebackers should focus on adding bulk (high protein/high calorie). Again, Tim Ferriss’ “The 4-Hour Body” (Amazon: USA/UK/FR/ES/DE/IT) is simply the best work written on the subject.
  <br> 5. Watch film <br>
  There’s a reason why Peyton Manning is one of the best in the game. He is not a great athlete, lacks any kind of real speed, has below average arm strength for an NFL quarterback and, is not particularly accurate compared to guys like Tom Brady, Drew Brees, or Aaron Rodgers. However, no one questions Peyton’s preparation and knowledge of the game. Most of this is achieved through the hours and hours he spends studying film. He studies his own game film and practice film, plus game film for upcoming opponents. This makes him mentally superior to almost anyone on the field.
  Watching film allows you to learn from your mistakes an see things from another perspective. You can also learn new techniques and moves from other players. As Malcolm Gladwell states, “Achievement is talent plus preparation.” Ask your coaches for a copy of their practice or game film to evaluate yourself. If your team hasn’t established a viable filming strategy, help them establish a plan to make this a reality. Be part of the solution.
  <br> 6. Position Specific Training <br>
  Make sure you identify the specific skill sets that are valued for your position. If you’re an offensive lineman, strength, size, toughness, and team-first mentality are valued above all else. If you’re a defensive back, quick feet, speed, good instincts, and a short-term memory are most important. Whether you’re in the gym or going for a run, make sure that everything you do centers around those skill sets. Linemen rarely run more than 20-30 yards on a single play, so a 5-mile run is probably not going to provide much value. Quarterbacks rarely need to make a tackle, so taking part in tackling drills is going to be minimally effective. By focusing on your position’s most-valued skill sets, you’ll prevent injuries and focus all of your available time on being the best you can be at your position. You need to be as efficient as possible with your time and effort.
  <br> 7. Get Your Sleep <br>
  Your body does 90% of its healing while you are sleeping. This is vitally important during the football season and most-important the night before a game. Alcohol interrupts your sleep cycle as well as the production of testosterone, which is beneficial for building muscle and energy. On game day, you need as much of both as you can get. Testosterone is generated from cholesterol, which is produced between 4:00-6:00am. Keeping a regular sleeping pattern and getting a full night’s sleep will allow your body to recover and give you the energy you need the next time you play.
  <br> 8. Play against better competition <br>
  One of the best ways to improve your game is to literally elevate your game. There are all sorts of creative ways to play against better competition. If you’re a Junior, ask the Senior Head Coach about attending Senior practices. Even if you’re only participating at a practice level, performing against players that are bigger, faster, and stronger will only force you to raise your skill level to compete. You may even consider playing for a team in a higher division within your own country, or in another country that has a higher level of play altogether. There are Dutch, Austrian, and Spanish players playing in Germany, for example. If you really want to challenge yourself, consider spending a semester or year abroad in the United States and walking onto the football team at your school. In all of these scenarios, the more you play against the best, the better you will be.
  <br> 9. Endurance training <br>
  By the 4th quarter, most football players are performing at about 85-90% of their normal capacity. Imagine if you were able to maintain 100% capacity for the entire length of a game? That would mean that you’d have a significant advantage in crunch time, the point at which most games are decided. If you’re still at peak endurance near the end of the game, you’re playing on an entirely different level than everyone else on the field. That means you have better focus, your coaches are more inclined to call a play that allows you to become the hero, and you garner the confidence of your teammates when the game is on the line.
  Work to get yourself in game shape by practicing at game speed. The more you play at full speed, the more prepared your body will be for the rigors of a football game. Run 40’s after practice, take more snaps, or run more routes. Just make sure you’re ready to go on game day.
  <br> 10. Get feedback <br>
  Ask your coaches for feedback on your play. The benefit of an objective opinion is that they see some things that you may not. You’ll be expressing the fact that you value their opinion and that you are focused on becoming a better player. These are very strong impressions to make in the eyes of a coach. Plus, you’ll be learning a lot about the strengths and weaknesses of your game that’ll give you some confidence and some areas to focus on."
},

{
"title":         "Sports Vision Skills You Can Practice at Home",
"category":        "Athletics",
"author":        "By Liz Segre and Marilyn Haddrill, with contributions and review by Donald S. Teig, OD",
"authorUrl":     "http://www.allaboutvision.com/sportsvision/skills.htm",
"publishedOn":        "2014-02-01",
"body":          "<strong>Sports Vision Skills You Can Practice at Home </strong> <br>
Methods of improving sports vision skills for optimum athletic performance will vary, depending on your sport.
For example, golfers need good hand-eye coordination, timing and depth perception to determine how and where a ball should be hit.
<br> Visual memory is a crucial sports vision skill for team players who must make split-second decisions about their next move based on where they see people and objects situated on a field or court.
On the other hand, keen visual memory is not as important for bowlers, who operate in a comparatively static environment.
Eye-foot coordination is important for soccer and tennis players, while peripheral vision is crucial for basketball. Contrast sensitivity is a key vision skill for skiers, who must see every shadow in the snow before them so they know when to turn.
Eye Dominance, Focus Flexibility and Other Sports Vision Skills
Here are a few more basic sports vision skills, some that you can practice at home:
<br>Focus Flexibility. This is the ability to change focus from a faraway object to a near one, or vice versa. If you are over age 40, you may have noticed that you are losing this ability (accommodation) and need reading glasses, multifocal eyeglasses or bifocal contact lenses to compensate.
You can't really improve your focus flexibility as successfully through vision training or eye exercises when loss of this skill is caused by presbyopia. However, everyone can practice focus flexibility by concentrating on switching focus between distant and near objects.
Quick Tip: Try frequently changing focus between your computer screen and a picture hanging on the wall across the room, or a scene outside the window. This not only helps your focus flexibility, but it also can relieve eye strain caused by extended time on the computer.
<br> Peripheral Awareness. This ability involves perceiving what's going on at either side of you without turning your head. Eye doctors test for peripheral vision loss by having you look straight ahead while lights flash at various angles off to the side.
Quick Tip: To improve this aspect of your vision for better sports performance, try looking at a busy scene with your head turned to one side (perhaps on TV or a computer screen, or on a sidewalk). Remember to practice from the left and from the right.
<br> Dynamic Visual Acuity. Dynamic visual acuity enables you to see objects clearly when they are moving quickly. You may have 20/20 vision when sitting still and reading an eye chart. But when motion is involved, your visual acuity could be worse. In sports vision testing, you might be asked to view objects or words that move fast across a computer screen and then identify them before they disappear.
Quick Tip: For those who still have old-fashioned record players in the home, the American Optometric Association recommends a homemade way to improve dynamic visual acuity: Cut letters of different sizes out of a magazine, put them on the turntable and — at arm's length — identify them as they revolve. Use different speeds (33, 45 and 78 revolutions per minute, or rpm), and then progress to smaller letters if the test becomes too easy.
<br> Depth Perception. This visual ability enables you to make spatial judgments, including how far away an object or person is from you. One test for this skill involves identifying objects or shapes that are in random, dot-patterned backgrounds.
Some of this ability depends strictly on physical characteristics. For example, spacing between the center of your two pupils (pupillary distance) is thought to play a major role in how well you see in three dimensions.
Quick Tip: Ever try to put the cap on a pen and miss? Practicing this skill at arm's length is one way to improve your depth perception. Another method is to hold a very small pebble or BB at arm's length and drop it into a drinking straw.
<br> Color Vision. Your ability to detect different colors and shades is important in ball sports such as football.
In fact, having a color deficiency can pose extra problems for some athletes. The most common color deficiency is an inability to distinguish red from green, which means a reddish-brown football on a green field could be tough to see.
Color deficiency tests include cards with random dot patterns printed in a particular color, along with an object shown in a different color. If you can't view the object, you can't distinguish between the two colors.
Some tinted lenses enhance particular colors, such as yellow, by filtering other colors. Even if you're not color deficient, enhancing the color of a ball (such as a yellow tennis ball) could help you see it better, so you have more time to react to it. Performance-enhancing sports eyewear and contact lenses can be designed with different tints for specific sports.
Quick Tip: Of course, you can't really practice seeing in different colors if you are color deficient. But you may be able to find special glasses or contacts for color blindness from a limited number of eye doctors in the United States. These specially tinted lenses enhance differences between certain colors to help people with a color vision deficiency better distinguish an object from its background.
<br> Hand and Eye Dominance. Understanding which eye dominates may help an athlete adopt better strategies for improving athletic performance.
Most athletes know they are either right-handed or left-handed, and they adjust body movements accordingly. But they may not realize that their dominant eye may process visual information more fully and accurately than their non-dominant eye.
As an example, knowing which eye dominates can help an athlete achieve better head and eye positioning to interpret fast action in sports such as basketball or baseball.
Some athletes are cross-dominant, meaning that a right-handed person is left-eye dominant or a left-handed person is right-eye dominant. This can be an advantage in some sports, but potentially a serious disadvantage in sports such as archery and target shooting where one side of the body is used to both aim and shoot.
Quick Tip: In target shooting, a dominant hand and dominant eye tend to work together much more efficiently when they are on the same side of the body. So if you have trouble hitting the target, cross dominance might be the reason. You may need to make adjustments such as switching the hand you usually use to hold your firearm to make sure you are able to view the target with your dominant eye.*
Sports Vision Training for Serious Athletes
For better sports performance, consider visiting a sports vision specialist for training and testing. Also, an eye doctor who specializes in sports vision can give you valuable advice about special eyewear such as sports safety goggles and performance-enhancing lens tints."
}

]
